export const questions = [
  {
    id: 1,
    title: 'React JS це...?',
    variants: ['Back-end платформа', 'JavaScript бібліотека', 'Фреймворк'],
    correct: 1,
  },
  {
    id: 2,
    title: 'Для чого використовують стан в React?',
    variants: [
      'Для зберігання внутрішніх динамічних даних компонента',
      'Для зберігання зовнішніх статичних даних компонента',
      'Для оптимізації роботи компонента',
    ],
    correct: 0,
  },
  {
    id: 3,
    title: 'Як можна контролювати частоту спрацьовування useEffect?',
    variants: [
      'Використовуючи обʼєкт залежностей',
      'Використовуючи масив залежностей',
      'Використовуючи хук useRef',
    ],
    correct: 1,
  },
  {
    id: 4,
    title: 'Виберіть неіснуючий етап життєвого циклу компонента',
    variants: ['Оновлення', 'Монтування', 'Рендер'],
    correct: 2,
  },
  {
    id: 5,
    title: 'Коли відбувається оновлення компонента?',
    variants: [
      'При оновленні стану або пропсів',
      'При оновленні будь-якої змінної',
      'Тільки при оновленні стану',
    ],
    correct: 0,
  },
  {
    id: 6,
    title: 'Як правильно створити унікальні ідентифікатори полів форми?',
    variants: [
      'Використовувати Date.now()',
      'Використовувати хук UseId',
      'Скористатися сторонньою бібліотекою',
    ],
    correct: 1,
  },
  {
    id: 7,
    title: 'Як отримати значення обраної опції select?',
    variants: [
      'event.target.option',
      'event.target.selected',
      'event.target.value',
    ],
    correct: 2,
  },
  {
    id: 8,
    title: 'Який проп компонента Provider відповідає за значення контексту?',
    variants: ['state', 'value', 'data'],
    correct: 1,
  },
  {
    id: 9,
    title: 'Який хук використовується для роботи з параметрами рядка запита?',
    variants: ['useParams', 'useQueryParams', 'useSearchParams'],
    correct: 2,
  },
  {
    id: 10,
    title: 'Який обовʼязковий пропс потрібно передати компоненту Suspense?',
    variants: ['fallback', 'loading', 'placeholder'],
    correct: 0,
  },
];
